export default {
    services:[
        '/services/AI/GenApi/images/Grok%20Imagine%20Image',
        '/services/AI/GenApi/images/Qwen%20Image%202'
    ],
    keywords: `
        Генерация изображений рисунков картинок иллюстраций
        Создание картинок
        Рисование по запросу
        Генерируй изображение
        Создай картинку
        Нарисуй по описанию
        Изобрази визуально
        Сгенерируй иллюстрацию
        Сделай визуализацию
        Отрисовка сцены    
        Генерация изображений`
}
