export default {
    metadata:{
        prompt:{
            is: 'oda-textarea',
            placeholder: 'Что ищем...'
        }
    },
    keywords: `Поиск файлов
Файловый поиск
Найти файл
Искать файлы
Операция поиска файла
Навык поиска документов
Восстановление файлов
Просмотр содержимого диска
Анализ файловых ресурсов
Работа с файлами
Локализация документа
Обнаружение документа
Инструмент поиска файлов
Функционал поиска файлов
Программный модуль поиска файлов
Сервис поиска файлов
Алгоритм поиска файлов
Интерфейс поиска файлов
Учет расположения файлов
Сканирование дисков
Функция поиска файлов
Путь к файлу
Система навигации файлов
Средство быстрого поиска файлов
Методология поиска файлов
Распределенный поиск файлов`,
    async execute(params = {}){
        
    }
}